minimax_bench/results/tp4_conc32_bench.log
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(backend='vllm', base_url='http://localhost:8002', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='MiniMaxAI/MiniMax-M2.5', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=320, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='minimax_bench/results', result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=512, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6564  max=8187  mean=7350.19  avg_token_mismatch=0.00  
 output_lens: min=409   max=511   mean=462.19  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:06<00:00,  6.54s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 320/320 [02:04<00:00,  2.57it/s]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     320       
Benchmark duration (s):                  124.52    
Total input tokens:                      2352062   
Total generated tokens:                  147900    
Request throughput (req/s):              2.57      
Output token throughput (tok/s):         1187.73   
Total Token throughput (tok/s):          20076.29  
---------------Time to First Token----------------
Mean TTFT (ms):                          482.30    
Median TTFT (ms):                        227.63    
P99 TTFT (ms):                           3854.87   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          25.04     
Median TPOT (ms):                        25.48     
P99 TPOT (ms):                           28.59     
---------------Inter-token Latency----------------
Mean ITL (ms):                           25.03     
Median ITL (ms):                         16.40     
P99 ITL (ms):                            166.79    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          12048.83  
Median E2EL (ms):                        12162.86  
P99 E2EL (ms):                           16037.09  
==================================================