minimax_bench/results/tp8ep_conc64_bench.log
[aiter] import [module_aiter_enum] under /app/aiter-test/aiter/jit/module_aiter_enum.so
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(backend='vllm', base_url='http://localhost:8002', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=64, model='MiniMaxAI/MiniMax-M2.5', tokenizer=None, best_of=1, use_beam_search=False, num_prompts=640, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, metadata=None, result_dir='/root/learn-kernels/minimax_bench/results', result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=8192, random_output_len=512, random_range_ratio=0.8, random_prefix_len=0, use_chat_template=False, hf_subset=None, hf_split=None, hf_output_len=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, num_warmups=1)
-------------------  Input/Output Length Statistics  -------------------
 input_lens : min=6553  max=8187  mean=7386.79  avg_token_mismatch=0.00  
 output_lens: min=409   max=512   mean=460.17  
------------------------------------------------------------------------ 

Starting initial single prompt test run...
Warming up with 1 requests...
100%|██████████| 1/1 [00:05<00:00,  5.96s/it]
Warmup completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 64
100%|██████████| 640/640 [02:17<00:00,  4.65it/s]
Starting main benchmark run...
============ Serving Benchmark Result ============
Successful requests:                     640       
Benchmark duration (s):                  137.75    
Total input tokens:                      4727544   
Total generated tokens:                  294507    
Request throughput (req/s):              4.65      
Output token throughput (tok/s):         2137.99   
Total Token throughput (tok/s):          36457.84  
---------------Time to First Token----------------
Mean TTFT (ms):                          541.40    
Median TTFT (ms):                        227.66    
P99 TTFT (ms):                           5031.68   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          28.11     
Median TPOT (ms):                        28.86     
P99 TPOT (ms):                           33.61     
---------------Inter-token Latency----------------
Mean ITL (ms):                           28.11     
Median ITL (ms):                         16.58     
P99 ITL (ms):                            257.76    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13477.32  
Median E2EL (ms):                        13498.20  
P99 E2EL (ms):                           18587.09  
==================================================